# 1. Какой класс? открываем конкретный файл                              +
# 2. Какой предмет?                                                      +
#     3. Показывает весь список учеников и их оценки по предмету         +
#     4. Вызвать к доске? если ввести exit то выходит из программы       +
#     5. На какую оценку ответ?                                          +
# 6. После выхода сохранить все изменения в текущий файл                 +

# 7. Выбор предмета сделал более 'Юсер френдли').
# 8. Ошибки обработал. 
    # При добавление нового файла с классом, необходимо записать его номер в файл: "list_of_classes.txt"

import controller

controller.journal()